export type Question = {
  id: number;
  text: string;
  options: string[];
};

export const questions = [ 
    {
        id: 1,
        text: "С кем вы собираетесь посетить место?",
        options: ["Один", "С компанией", "С семьей", "Неважно"]

    },
    {
        id: 2,
        text: "Вы уже бывали в Перми?",
        options: ["Да", "Нет", "Неважно"]

    },
    {
        id: 3,
        text: "Какой бюджет на человека?",
        options: ["Нет","до 1500 ₽", "1500-3000 ₽", "3000-10000 ₽", "от 10000₽", "Неважно"]

    },
    {
        id: 4,
        text: "Какой формат отдыха вы предпочитаете?",
        options: ["Активный","Спокойный", "Неважно"]

    },
    {
        id: 5,
        text: "В какое время планируете идти?",
        options: ["Утро","День", "Вечер", "Ночь", "Неважно"]

    },
    {
        id: 6,
        text: "Какое у вас сегодня настроение?",
        options: ["Расслабленное","Весёлое", "Романтичное", "Любознательное", "Энергичное",]

    },
    {
        id: 7,
        text: "Интересуются ли вас культурные места города?",
        options: ["Да","Нет", "Неважно"]

    },
    {
        id: 8,
        text: "Где хотите провести время?",
        options: ["На улице","В помощении", "Неважно"]

    }
    
];